Revit 2027 API
WorksetId.LessThan Operator
Determines whether this WorksetId is less than another WorksetId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool operator <(
	WorksetId WorksetId1,
	WorksetId WorksetId2
)
Public Shared Operator < (
	WorksetId1 As WorksetId,
	WorksetId2 As WorksetId
) As Boolean
public:
static bool operator <(
	WorksetId^ WorksetId1,
	WorksetId^ WorksetId2
)
static let inline (<)
        WorksetId1 : WorksetId *
        WorksetId2 : WorksetId  : bool
Parameters
WorksetId1 WorksetId
The first WorksetId.
WorksetId2 WorksetId
The second WorksetId.
Return Value
Boolean
True if the first WorksetId is less than the second WorksetId, otherwise, false.
See Also
Reference
WorksetId Class
Autodesk.Revit.DB Namespace